apache/nuttx/arch/arm/src/stm32wb/stm32wb_rcc.c
#if defined(STM32_BOARD_USEHSI)
  /* Already set above */

#elif defined(STM32_BOARD_USEMSI)
  /* Enable Internal Multi-Speed Clock (MSI) */

  /* Wait until the MSI is either off or ready (or until a timeout elapsed) */

  for (timeout = MSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      regval = getreg32(STM32_RCC_CR);

      if ((regval & RCC_CR_MSIRDY) || ~(regval & RCC_CR_MSION))
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

  /* Setting MSIRANGE */

  regval  = getreg32(STM32_RCC_CR);
  regval &= ~RCC_CR_MSIRANGE_MASK;
  regval |= (STM32_BOARD_MSIRANGE | RCC_CR_MSION);    /* Enable MSI and frequency */
  putreg32(regval, STM32_RCC_CR);

  /* Wait until the MSI is ready (or until a timeout elapsed) */

  for (timeout = MSIRDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the MSIRDY flag is the set in the CR */

      if ((getreg32(STM32_RCC_CR) & RCC_CR_MSIRDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }

#elif defined(STM32_BOARD_USEHSE)
  /* Enable External High-Speed Clock (HSE) */

  regval  = getreg32(STM32_RCC_CR);
  regval |= RCC_CR_HSEON;           /* Enable HSE */
  putreg32(regval, STM32_RCC_CR);

  /* Wait until the HSE is ready (or until a timeout elapsed) */

  for (timeout = HSERDY_TIMEOUT; timeout > 0; timeout--)
    {
      /* Check if the HSERDY flag is the set in the CR */

      if ((getreg32(STM32_RCC_CR) & RCC_CR_HSERDY) != 0)
        {
          /* If so, then break-out with timeout > 0 */

          break;
        }
    }
#else

#  error stm32_stdclockconfig(), must have one of STM32_BOARD_USEHSI, STM32_BOARD_USEMSI, STM32_BOARD_USEHSE defined

#endif

  /* Check for a timeout.  If this timeout occurs, then we are hosed.  We
   * have no real back-up plan, although the following logic makes it look
   * as though we do.
   */

  if (timeout > 0)
    {
      /* Setup regulator voltage according to clock frequency */

      regval  = getreg32(STM32_PWR_CR1);
      regval &= ~PWR_CR1_VOS_MASK;
#if STM32_SYSCLK_FREQUENCY > 16000000 || \
    (defined(BOARD_MAX_PLL_FREQUENCY) && BOARD_MAX_PLL_FREQUENCY > 16000000)
      regval |= PWR_CR1_VOS_RANGE1;
#else
      regval |= PWR_CR1_VOS_RANGE2;
#endif
      putreg32(regval, STM32_PWR_CR1);

      /* Set the HCLK source/divider */

      regval  = getreg32(STM32_RCC_CFGR);
      regval &= ~RCC_CFGR_HPRE_MASK;
      regval |= STM32_RCC_CFGR_HPRE;
      putreg32(regval, STM32_RCC_CFGR);

      /* Set the CPU2 HCLK2 source/divider */

      regval  = getreg32(STM32_RCC_EXTCFGR);
      regval &= ~RCC_EXTCFGR_C2HPRE_MASK;
      regval |= STM32_RCC_EXTCFGR_C2HPRE;
      putreg32(regval, STM32_RCC_EXTCFGR);

      /* Set the HCLK4 source/divider */

      regval  = getreg32(STM32_RCC_EXTCFGR);
      regval &= ~RCC_EXTCFGR_SHDHPRE_MASK;
      regval |= STM32_RCC_EXTCFGR_SHDHPRE;
      putreg32(regval, STM32_RCC_EXTCFGR);

      /* Set the PCLK1 divider */

      regval  = getreg32(STM32_RCC_CFGR);
      regval &= ~RCC_CFGR_PPRE1_MASK;
      regval |= STM32_RCC_CFGR_PPRE1;
      putreg32(regval, STM32_RCC_CFGR);

      /* Set the PCLK2 divider */

      regval  = getreg32(STM32_RCC_CFGR);
      regval &= ~RCC_CFGR_PPRE2_MASK;
      regval |= STM32_RCC_CFGR_PPRE2;
      putreg32(regval, STM32_RCC_CFGR);

      /* Configure Main PLL */

      regval  = getreg32(STM32_RCC_PLLCFG);
      regval &= ~(RCC_PLLCFG_PLLM_MASK | RCC_PLLCFG_PLLN_MASK);
      regval |= (STM32_PLLCFG_PLLM | STM32_PLLCFG_PLLN);

      /* Set the PLL dividers and multipliers to configure the main PLL */

      regval &= ~(RCC_PLLCFG_PLLPEN | RCC_PLLCFG_PLLQEN | RCC_PLLCFG_PLLREN);
#ifdef STM32_PLLCFG_PLLP_ENABLED
      regval &= ~RCC_PLLCFG_PLLP_MASK;
      regval |= (RCC_PLLCFG_PLLPEN | STM32_PLLCFG_PLLP);
#endif
#ifdef STM32_PLLCFG_PLLQ_ENABLED
      regval &= ~RCC_PLLCFG_PLLQ_MASK;
      regval |= (RCC_PLLCFG_PLLQEN | STM32_PLLCFG_PLLQ);
#endif
#ifdef STM32_PLLCFG_PLLR_ENABLED
      regval &= ~RCC_PLLCFG_PLLR_MASK;
      regval |= (RCC_PLLCFG_PLLREN | STM32_PLLCFG_PLLR);
#endif

      /* XXX The choice of clock source to PLL (all three) is independent
       * of the sys clock source choice, review the STM32_BOARD_USEHSI
       * name; probably split it into two, one for PLL source and one
       * for sys clock source.
       */

      regval &= ~RCC_PLLCFG_PLLSRC_MASK;
#ifdef STM32_BOARD_USEHSI
      regval |= RCC_PLLCFG_PLLSRC_HSI16;
#elif defined(STM32_BOARD_USEMSI)
      regval |= RCC_PLLCFG_PLLSRC_MSI;
#else /* if STM32_BOARD_USEHSE */
      regval |= RCC_PLLCFG_PLLSRC_HSE;
#endif

      putreg32(regval, STM32_RCC_PLLCFG);

      /* Enable the main PLL */

      regval  = getreg32(STM32_RCC_CR);
      regval |= RCC_CR_PLLON;
      putreg32(regval, STM32_RCC_CR);

      /* Wait until the PLL is ready */

      while ((getreg32(STM32_RCC_CR) & RCC_CR_PLLRDY) == 0)
        {
        }

#ifdef CONFIG_STM32_SAI1PLL
      /* Configure SAI1 PLL */

      regval  = getreg32(STM32_RCC_PLLSAI1CFG);
      regval &= ~RCC_PLLSAI1CFG_PLLN_MASK;
      regval |= STM32_PLLSAI1CFG_PLLN;

      /* Set the PLL dividers and multipliers to configure the SAI1 PLL */

      regval &= ~(RCC_PLLSAI1CFG_PLLPEN | RCC_PLLSAI1CFG_PLLQEN |
                  RCC_PLLSAI1CFG_PLLREN);
#ifdef STM32_PLLSAI1CFG_PLLP_ENABLED
      regval &= ~RCC_PLLSAI1CFG_PLLP_MASK;
      regval |= (RCC_PLLSAI1CFG_PLLPEN | STM32_PLLSAI1CFG_PLLP);
#endif
#ifdef STM32_PLLSAI1CFG_PLLQ_ENABLED
      regval &= ~RCC_PLLSAI1CFG_PLLQ_MASK;
      regval |= (RCC_PLLSAI1CFG_PLLQEN | STM32_PLLSAI1CFG_PLLQ);
#endif
#ifdef STM32_PLLSAI1CFG_PLLR_ENABLED
      regval &= ~RCC_PLLSAI1CFG_PLLR_MASK;
      regval |= (RCC_PLLSAI1CFG_PLLREN | STM32_PLLSAI1CFG_PLLR);
#endif

      putreg32(regval, STM32_RCC_PLLSAI1CFG);

      /* Enable the SAI1 PLL */

      regval  = getreg32(STM32_RCC_CR);
      regval |= RCC_CR_PLLSAI1ON;
      putreg32(regval, STM32_RCC_CR);

      /* Wait until the PLL is ready */

